DETECTIVE()                                                        DETECTIVE()



NNAAMMEE
       detective -

DDEESSCCRRIIPPTTIIOONN
       Detective  uses  machine  learning  and purpose-built visualizations to
       help you analyze and investigate security issues across your Amazon Web
       Services  (AWS)  workloads. Detective automatically extracts time-based
       events such as login attempts, API calls, and network traffic from  AWS
       CloudTrail  and Amazon Virtual Private Cloud (Amazon VPC) flow logs. It
       also extracts findings detected by Amazon GuardDuty.

       The Detective API primarily supports the creation and management of be-
       havior  graphs. A behavior graph contains the extracted data from a set
       of member accounts, and is created and managed by a master account.

       Every behavior graph is specific to a Region. You can only use the  API
       to  manage graphs that belong to the Region that is associated with the
       currently selected endpoint.

       A Detective master account can use the Detective API to do the  follow-
       ing:

       +o Enable and disable Detective. Enabling Detective creates a new behav-
         ior graph.

       +o View the list of member accounts in a behavior graph.

       +o Add member accounts to a behavior graph.

       +o Remove member accounts from a behavior graph.

       A member account can use the Detective API to do the following:

       +o View the list of behavior graphs that they are invited to.

       +o Accept an invitation to contribute to a behavior graph.

       +o Decline an invitation to contribute to a behavior graph.

       +o Remove their account from a behavior graph.

       All API actions are logged as CloudTrail events. See _L_o_g_g_i_n_g  _D_e_t_e_c_t_i_v_e
       _A_P_I _C_a_l_l_s _w_i_t_h _C_l_o_u_d_T_r_a_i_l .

AAVVAAIILLAABBLLEE CCOOMMMMAANNDDSS
       +o accept-invitation

       +o create-graph

       +o create-members

       +o delete-graph

       +o delete-members

       +o disassociate-membership

       +o get-members

       +o help

       +o list-graphs

       +o list-invitations

       +o list-members

       +o reject-invitation

       +o start-monitoring-member



                                                                   DETECTIVE()
