SECRETSMANAGER()                                              SECRETSMANAGER()



NNAAMMEE
       secretsmanager -

DDEESSCCRRIIPPTTIIOONN
       AWS  Secrets Manager provides a service to enable you to store, manage,
       and retrieve, secrets.

       This guide provides descriptions of the Secrets Manager API.  For  more
       information  about using this service, see the _A_W_S _S_e_c_r_e_t_s _M_a_n_a_g_e_r _U_s_e_r
       _G_u_i_d_e .
          AAPPII VVeerrssiioonn

       This version of the Secrets Manager API Reference documents the Secrets
       Manager API version 2017-10-17.

       NNOOTTEE::
          As an alternative to using the API, you can use one of the AWS SDKs,
          which consist of libraries and sample code for  various  programming
          languages  and platforms such as Java, Ruby, .NET, iOS, and Android.
          The SDKs provide a convenient way to create programmatic  access  to
          AWS Secrets Manager. For example, the SDKs provide cryptographically
          signing requests, managing errors, and retrying  requests  automati-
          cally.  For more information about the AWS SDKs, including download-
          ing and installing them, see _T_o_o_l_s _f_o_r _A_m_a_z_o_n _W_e_b _S_e_r_v_i_c_e_s .

       We recommend you use the AWS SDKs to make programmatic API calls to Se-
       crets Manager. However, you also can use the Secrets Manager HTTP Query
       API to make direct calls to the Secrets Manager web service.  To  learn
       more  about  the  Secrets  Manager HTTP Query API, see _M_a_k_i_n_g _Q_u_e_r_y _R_e_-
       _q_u_e_s_t_s in the _A_W_S _S_e_c_r_e_t_s _M_a_n_a_g_e_r _U_s_e_r _G_u_i_d_e .

       Secrets Manager API supports GET and POST requests for all actions, and
       doesn't  require  you  to use GET for some actions and POST for others.
       However, GET requests are subject to the  limitation  size  of  a  URL.
       Therefore,  for  operations  that  require larger sizes, use a POST re-
       quest.
          SSuuppppoorrtt aanndd FFeeeeddbbaacckk ffoorr AAWWSS SSeeccrreettss MMaannaaggeerr

       We    welcome    your    feedback.    Send     your     comments     to
       _a_w_s_s_e_c_r_e_t_s_m_a_n_a_g_e_r_-_f_e_e_d_b_a_c_k_@_a_m_a_z_o_n_._c_o_m , or post your feedback and ques-
       tions in the _A_W_S _S_e_c_r_e_t_s _M_a_n_a_g_e_r _D_i_s_c_u_s_s_i_o_n _F_o_r_u_m . For  more  informa-
       tion about the AWS Discussion Forums, see _F_o_r_u_m_s _H_e_l_p .
          HHooww eexxaammpplleess aarree pprreesseenntteedd

       The  JSON  that  AWS Secrets Manager expects as your request parameters
       and the service returns as a response to HTTP  query  requests  contain
       single, long strings without line breaks or white space formatting. The
       JSON shown in the examples displays the code formatted with  both  line
       breaks  and  white space to improve readability. When example input pa-
       rameters can also cause long strings extending beyond the  screen,  you
       can insert line breaks to enhance readability. You should always submit
       the input as a single JSON text string.
          LLooggggiinngg AAPPII RReeqquueessttss

       AWS Secrets Manager supports AWS CloudTrail, a service that records AWS
       API  calls  for your AWS account and delivers log files to an Amazon S3
       bucket. By using information that's collected by  AWS  CloudTrail,  you
       can  determine  the  requests successfully made to Secrets Manager, who
       made the request, when it was made, and so on. For more about  AWS  Se-
       crets  Manager  and support for AWS CloudTrail, see _L_o_g_g_i_n_g _A_W_S _S_e_c_r_e_t_s
       _M_a_n_a_g_e_r _E_v_e_n_t_s _w_i_t_h _A_W_S _C_l_o_u_d_T_r_a_i_l in  the  _A_W_S  _S_e_c_r_e_t_s  _M_a_n_a_g_e_r  _U_s_e_r
       _G_u_i_d_e  . To learn more about CloudTrail, including enabling it and find
       your log files, see the _A_W_S _C_l_o_u_d_T_r_a_i_l _U_s_e_r _G_u_i_d_e .

AAVVAAIILLAABBLLEE CCOOMMMMAANNDDSS
       +o cancel-rotate-secret

       +o create-secret

       +o delete-resource-policy

       +o delete-secret

       +o describe-secret

       +o get-random-password

       +o get-resource-policy

       +o get-secret-value

       +o help

       +o list-secret-version-ids

       +o list-secrets

       +o put-resource-policy

       +o put-secret-value

       +o restore-secret

       +o rotate-secret

       +o tag-resource

       +o untag-resource

       +o update-secret

       +o update-secret-version-stage

       +o validate-resource-policy



                                                              SECRETSMANAGER()
